Revit 2027 API
RebarFreeFormAccessor.RebarStyle Property
 Identifies the RebarStyle of the current Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarStyle RebarStyle { get; set; }
Public Property RebarStyle As RebarStyle
	Get
	Set
public:
property RebarStyle RebarStyle {
	RebarStyle get ();
	void set (RebarStyle value);
}
member RebarStyle : RebarStyle with get, set
Property Value
RebarStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace